src/cf/InformationRegisters/МетодыОпределенияПрямыхРасходовПроизводстваВНУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>МетодыОпределенияПрямыхРасходовПроизводстваВНУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасходовНУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасходовНУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Comment>Счет учета прямых расходов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорСчет</Name>
					<Comment>Корреспондирующий счет</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыРасходовНУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыРасходовНУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АмортизационнаяПремия</Name>
					<Comment>Амортизационная премия (п. 1.1 ст. 259 НК РФ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Амортизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АрендаФедеральногоИМуниципальногоИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеЛичноеСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомандировочныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогиИСборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитываемыеВЦеляхНалогообложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НИОКР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбязательноеИДобровольноеСтрахованиеИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсвоениеПриродныхРесурсов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредставительскиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаРекламуНормируемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемонтОсновныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/МетодыОпределенияПрямыхРасходовПроизводстваВНУ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Функция ВидРасходаДопускаетсяВСписокПрямых(ВидРасхода) 
	Если (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование")) Или 
	     (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности")) Или  
	     (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников")) Или   
	     (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.АмортизационнаяПремия")) Или   
		 (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.РасходыНаРекламуНормируемые")) Или   
	     (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.ПредставительскиеРасходы")) Тогда  
		Сообщить("Вид расхода " + ВидРасхода +" может быть только косвенным");
		Возврат Ложь;
	КонецЕсли;  
	Возврат Истина; 
КонецФункции

&НаКлиенте
Процедура АтрибутФормы_ПриИзменении(Элемент)
	Если Элемент.Имя="СтатьяЗатрат" Тогда
		Если Не ЗначениеЗаполнено(Запись.СтатьяЗатрат) Тогда  
			Возврат; 
		ИначеЕсли НЕ ВидРасходаДопускаетсяВСписокПрямых(Запись.ВидРасходовНУ) Тогда  
			Запись.СтатьяЗатрат=ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
			Возврат;
		КонецЕсли;
		Если Не ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Запись.СтатьяЗатрат, "ВидРасходовНУ")=Запись.ВидРасходовНУ Тогда
			Сообщить("Укажите статью затрат с видом расходов (НУ): " + Запись.ВидРасходовНУ);
			Запись.СтатьяЗатрат=ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
		КонецЕсли;

	ИначеЕсли Элемент.Имя="ВидРасходовНУ" Тогда
		Если Не ЗначениеЗаполнено(Запись.ВидРасходовНУ) Тогда  
			Возврат;   
		ИначеЕсли НЕ ВидРасходаДопускаетсяВСписокПрямых(Запись.ВидРасходовНУ) Тогда
			Запись.ВидРасходовНУ = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.ПустаяСсылка"); 
			Возврат;
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(Запись.СтатьяЗатрат) Тогда 
			Если НЕ ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Запись.СтатьяЗатрат, "ВидРасходовНУ") = Запись.ВидРасходовНУ Тогда
				Запись.СтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
